## Plan Result (stg_apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.api-mgmt.azurerm_public_ip.apim
* Update
  * module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main
* Delete
  * module.api-mgmt.module.application_insights.azurerm_monitor_action_group.action_group




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.azurerm_public_ip.apim will be created
  + resource "azurerm_public_ip" "apim" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "cft-api-mgmt-aat-pip"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-api-mgmt-aat-private-pip"
      + resource_group_name     = "cft-aat-network-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # module.api-mgmt.module.application_insights.azurerm_monitor_action_group.action_group will be destroyed
  # (because azurerm_monitor_action_group.action_group is not in configuration)
  - resource "azurerm_monitor_action_group" "action_group" {
      - enabled             = true -> null
      - id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Insights/actionGroups/Cft-Aat-Warning-Alerts" -> null
      - location            = "global" -> null
      - name                = "Cft-Aat-Warning-Alerts" -> null
      - resource_group_name = "cft-aat-network-rg" -> null
      - short_name          = "cft-aat" -> null
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "staging"
          - "startupMode"  = "always"
        } -> null

      - azure_function_receiver {
          - function_app_resource_id = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-alerts-slack-aat/providers/Microsoft.Web/sites/cft-alerts-slack-aat" -> null
          - function_name            = "httpTrigger" -> null
          - http_trigger_url         = (sensitive value) -> null
          - name                     = "slack-alerts" -> null
          - use_common_alert_schema  = true -> null
        }
    }

  # module.api-mgmt.module.application_insights.azurerm_monitor_activity_log_alert.main will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached"
        name                = "Application Insights daily cap reached"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)

      ~ action {
          ~ action_group_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Insights/actionGroups/Cft-Aat-Warning-Alerts" -> "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1995,"Program":"tfcmt","SHA1":"","Target":"stg_apim","Vars":{}} -->